Revit 2024 API
ElementIntersectsSolidFilter Methods
The ElementIntersectsSolidFilter type exposes the following members.
Methods
Name | Description
Dispose |  (Inherited from ElementFilter.)
Equals
Determines whether the specified Object is equal to the current Object.
 (Inherited from Object.)
GetHashCode
Serves as a hash function for a particular type.
 (Inherited from Object.)
GetSolid
 Gets the target solid geometry.
GetType
Gets the Type of the current instance.
 (Inherited from Object.)
PassesFilter(Element)
 Applies the filter to a given element.
 (Inherited from ElementFilter.)
PassesFilter(Document, ElementId)
 Applies the filter to a given element.
 (Inherited from ElementFilter.)
ToString
Returns a string that represents the current object.
 (Inherited from Object.)
See Also
ElementIntersectsSolidFilter Class
Autodesk.Revit.DB Namespace